app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "KFC"], ["user_id", 1], ["created_at", "2015-07-23 20:12:42.073371"], ["updated_at", "2015-07-23 20:12:42.073371"]]
---
  def create
    @restaurant = current_user.restaurants.create(restaurant_params)