app/controllers/reviews_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("thoughts", "rating", "restaurant_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["thoughts", "shit"], ["rating", 1], ["restaurant_id", 1], ["user_id", 1], ["created_at", "2015-07-23 22:14:10.121476"], ["updated_at", "2015-07-23 22:14:10.121476"]]
---
  def create
    @restaurant = Restaurant.find(params[:restaurant_id])
    review = @restaurant.reviews.build(review_params)
    review.user = current_user
    review.save